SET autocommit=0;
START TRANSACTION;

insert into issues(id, description, status, created_at, updated_at) values
  (1, '一', 1, '2016-06-22 12:00:00', '2016-06-22 12:00:00');

insert into questions(id, name, description, status, issue_id, source_type, source_url, remark, created_at, updated_at) values
  (1, 'Nginx', '高性能的负载均衡、HTTP和反向代理服务器', 1, 1, 1, 'https://www.nginx.com/resources/wiki/community/faq/', '', '2016-06-22 12:00:00', '2016-06-22 12:00:00'),
  (2, 'Django', '基于Python的快速Web开发框架', 1, 1, 1, 'https://docs.djangoproject.com/en/1.9/faq/general/#what-does-django-mean-and-how-do-you-pronounce-it', 'D不发音', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (3, 'lucene', '基于Java的全文索引/检索引擎', 1, 1, 1, 'https://mail-archives.apache.org/mod_mbox/lucene-java-user/200503.mbox/%3Cb49d8a896c644a335521bc3d91db0676@ehatchersolutions.com%3E#archives', 'Doug Cutting的妻子名字的中间名', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (4, 'UBUNTU', '以桌面应用为主的Linux操作系统', 1, 1, 2, 'https://simple.wikipedia.org/wiki/Ubuntu', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (5, 'GNU', '一个类UNIX的操作系统，由GNU计划推动，目标在于创建一个完全兼容于UNIX的自由软件环境', 1, 1, 1, 'https://www.gnu.org/gnu/pronunciation.html', '单词gnu读作怒，而GNU这里读作哥怒', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (6, 'Integer', '计算机语言中的一种数据类型', 1, 1, 0, '', '重音在前，i不发唉的音', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (7, 'Cache', '用于提升访问速度的一种技术，最早用于CPU，现广泛用于硬盘、网络等环境', 1, 1, 0, 'https://en.wiktionary.org/wiki/cache', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (8, 'WSDL', '（网络服务描述语言，Web Services Description Language）是一门基于XML 的语言，用于描述Web Services 以及如何对它们进行访问', 1, 1, 2, 'https://en.wikipedia.org/wiki/Web_Services_Description_Language', '发音时连读', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (9, 'Debian', '由GPL和其他自由软件许可协议授权的自由软件组成的操作系统，由Debian项目（Debian Project）组织维护', 1, 1, 1, 'https://www.debian.org/doc/manuals/debian-faq/ch-basic_defs.en.html', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (10, 'width', '宽度', 1, 1, 0, '', '无论英音美音，i这里都是[i]而非[ai]', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (11, 'Adobe', '一家位于美国的数字媒体和在线营销方案供应商，Photoshop是其旗下最为出名的图像处理软件之一', 1, 1, 2, 'https://en.wiktionary.org/wiki/adobe#Pronunciation', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (12, 'Skype', '一款即时通信应用软件', 1, 1, 2, 'https://en.wiktionary.org/wiki/skype', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (13, 'APP', 'Application的简称，通常指运行在移动设备上的应用', 1, 1, 1, '', '通常读作爱普', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (14, 'agile', '一种以人为核心、采用增量和迭代的快速软件开发方法，强调协作、沟通，可以快速应付需求变化', 1, 1, 0, '', '英音', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (15, 'Laravel', '一个开源的PHP Web开发框架', 1, 1, 1, 'http://laravel.io/forum/05-14-2014-how-to-pronounce-laravel', '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (16, 'MySQL', '一个开源的关系型数据库', 1, 1, 1, 'http://dev.mysql.com/doc/refman/5.7/en/what-is-mysql.html', '官方读音是“My Ess Que Ell”而非“my sequel”，但并不介意读成“my sequel”', '2016-06-22 12:00:00','2016-06-22 12:00:00');

-- type: 0: 未知，1：官网，2：wiki
insert into choices(id, question_id, name_ipa, name_alias, name_cn, is_correct, audio_url, created_at, updated_at) values
  (1, 1, '', 'en-juhn-eks', '恩贞-埃克斯', 1, '', '2016-06-22 12:00:00', '2016-06-22 12:00:00'), 
  (2, 1, '', 'en-jingks', '恩贞-克斯', 0, '', '2016-06-22 12:00:00', '2016-06-22 12:00:00'),
  (3, 2, '/ˈdʒæŋɡoʊ/', '', '粘钩', 1,'http://red-bean.com/~adrian/django_pronunciation.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (4, 2, '/diˈdʒæŋɡoʊ/', '', '地粘钩', '', 0, '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (5, 2, '/ˈjæŋɡoʊ/', '', '将钩', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (6, 3, '[ˈluːsin]', 'loo-seen', '鲁seen', 1, 'http://res-tts.iciba.com/4/4/1/44138f63dc165fe379ce9a27fd08653e.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (7, 3, '[ˈljoʊːsin]', 'lyo-seen', '留seen', '', 0, '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (8, 3, '[ˈluːsen]', '', 'lu-sen', '鲁森', 0, '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (9, 4, '', 'oo-boon-too', '乌邦图', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (10, 4, '', 'you-boon-too', '优邦图', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (11, 4, '', 'oo-bun-too', '乌奔图', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (12, 4, '', 'you-bun-too', '优奔图', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (13, 5, '', 'ge-nu', '哥怒', 1, 'https://www.gnu.org/audio/gnu-pronunciation.ogg', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (14, 5, '', 'jee-nu', '姬怒', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (15, 5, '', 'nu', '怒', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (16, 5, '', 'jee-en-yo', '姬-嗯-优', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (17, 6, '[ˈintidʒə(r)]', '', '音剃摺儿', 1, 'http://dictionary.cambridge.org/media/english-chinese-simplified/uk_pron/u/uki/ukins/ukinsur013.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (18, 6, '[inˈtaidʒə(r)]', '', '音抬摺儿', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (19, 6, '[inˈtaigə(r)]', '', '音抬哥儿', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (20, 7, '/kæʃ/', '', '忾湿', 1, 'http://dictionary.cambridge.org/media/english-chinese-simplified/uk_pron/u/ukb/ukbys/ukbysta022.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (21, 7, '/kætʃ/', '', '忾吃', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (22, 7, '/keitʃ/', '', '尅吃', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (23, 8, '/ˈwizdəl/', '微思豆', '', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (24, 8, '', 'W-S-D-L', '', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (25, 9, '/ˈdɛbiən/', '', '呆宾', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (26, 9, '/ˈdebiən/', '', '得宾', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (27, 9, '/ˈdibiən/', '', '地宾', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (28, 10, '[widθ]', '', '微思', 1, 'http://dictionary.cambridge.org/media/english/uk_pron/u/ukw/ukwi_/ukwi___015.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (29, 10, '[waiθ]', '', '外思', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (30, 11, '[əˈdəʊbi]', '', '阿斗比', 1, 'http://dictionary.cambridge.org/media/english-chinese-simplified/uk_pron/u/uka/ukadm/ukadmon004.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (31, 11, '[əˈdəʊb]', '', '阿斗伯', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (32, 12, '/skaip/', '', '思盖扑', 1, 'http://dictionary.cambridge.org/media/english-chinese-simplified/uk_pron/u/uka/uka31/uka31436.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (33, 12, '/ˈskaipi/', '', '思盖屁', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (34, 13, '[æp]', '', '爱普', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (35, 13, '', 'A-P-P', 'ei批批', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (36, 14, '/ˈædʒaɪl/', '', '哎寨偶', 1, 'http://dictionary.cambridge.org/media/english-chinese-simplified/uk_pron/u/uka/ukage/ukage__028.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (37, 14, '/ˈeidʒaɪl/', '', 'ei寨偶', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (38, 15, '/ˈlærəvel/', '', '来若外偶', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (39, 15, '/ˈlɑ:rʌvel/', '', '拉ra外偶', 0, 'http://audio.forvo.com/audios/mp3/l/z/lz_9294055_39_2289308_1.mp3', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (40, 16, '/maiˌɛskju:ˈɛl/', 'My-S-Q-L', '', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (41, 16, '/maɪˈsi:kwəl/', 'my sequel', '', 1, '', '2016-06-22 12:00:00','2016-06-22 12:00:00'),
  (42, 16, '', '', '我真的不知道', 0, '', '2016-06-22 12:00:00','2016-06-22 12:00:00');

COMMIT;
SET autocommit=1;
